## 02. Excel試算表 
* pandas 是一個資料處理與資料分析常用的開源套件。[[連結]](https://pandas.pydata.org/docs/index.html)

In [1]:
import pandas as pd

In [2]:
# 建立一列表的資料集
data = [[23, 175, 68],[18, 168, 55],[30, 173, 75]]

# 給予資料與欄位，建立一DataFrame
df = pd.DataFrame(data, columns=['age', 'height', 'weight'])

In [3]:
# 取得前面資料(預設五筆)
df.head(2)

   age  height  weight
0   23     175      68
1   18     168      55

In [4]:
# 取得後面資料(預測五筆)
df.tail(2)

   age  height  weight
1   18     168      55
2   30     173      75

In [5]:
# 讀取一欄為資料
data_age = df["age"]
print(data_age)

0    23
1    18
2    30
Name: age, dtype: int64

In [6]:
# 儲存csv, excel, json檔案
df.to_csv("test.csv", index=False) # index為第一行id不存
df.to_excel("test.xlsx", index=False , sheet_name='Sheet_name_1') # 給定工作表sheet_name
df.to_json("test.json")

# 讀取csv, excel, json檔案
df = pd.read_csv("test.csv")
df = pd.read_excel("test.xlsx",engine='openpyxl')
df = pd.read_json("test.json")

In [7]:
# 新建一欄位 - 方法一
data_sex = ["M", "F", "M"]
df["sex"] = data_sex
df

   age  height  weight sex
0   23     175      68   M
1   18     168      55   F
2   30     173      75   M

In [8]:
# 新建一欄位 - 方法二
df.insert(1,"city",['Japan','Taiwan','USA'])
df

   age    city  height  weight sex
0   23   Japan     175      68   M
1   18  Taiwan     168      55   F
2   30     USA     173      75   M

In [9]:
# 新增多欄位
df = df.assign(SBP = [120,114,145], 
               DBP = [85,90,75])
df

   age    city  height  weight sex  SBP  DBP
0   23   Japan     175      68   M  120   85
1   18  Taiwan     168      55   F  114   90
2   30     USA     173      75   M  145   75

In [10]:
# 新建一筆資料（列）
data_add = pd.DataFrame({"age": 25, 
                         "city": "Taiwan", 
                         "height": 158,
                         "weight": 50,
                         "sex": "F", 
                         "SBP": 110,
                         "DBP": 78}, 
                        index=[3])
df = df.append(data_add)
df

   age    city  height  weight sex  SBP  DBP
0   23   Japan     175      68   M  120   85
1   18  Taiwan     168      55   F  114   90
2   30     USA     173      75   M  145   75
3   25  Taiwan     158      50   F  110   78

### Homework 02
* 再新增一欄位為 「BMI」，其數值為height與weight所計算的，型別為浮點數取小數點兩位

In [11]:
data_height = df["height"]
data_weight = df["weight"]
data_BMI = data_weight/(data_height/100)**2
data_BMI = data_BMI.round(2)
df["BMI"] = data_BMI
df

   age    city  height  weight sex  SBP  DBP    BMI
0   23   Japan     175      68   M  120   85  22.20
1   18  Taiwan     168      55   F  114   90  19.49
2   30     USA     173      75   M  145   75  25.06
3   25  Taiwan     158      50   F  110   78  20.03